# GetGUID Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterId..::..GetGUID Method
UpdaterId Class See Also
---
GUID value of the UpdaterId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Guid GetGUID()
```

Visual Basic
---
```text
Public Function GetGUID As Guid
```

Visual C++
---
```text
public:
Guid GetGUID()
```

# See Also
UpdaterId Class
Autodesk.Revit.DB Namespace